IvanPoberezhniuk/controller/firmware/stm32-common/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MOTOR1_RIS_Pin GPIO_PIN_4
#define MOTOR1_RIS_GPIO_Port GPIOA
#define MOTOR1_LIS_Pin GPIO_PIN_5
#define MOTOR1_LIS_GPIO_Port GPIOA
#define MOTOR0_RIS_Pin GPIO_PIN_6
#define MOTOR0_RIS_GPIO_Port GPIOA
#define MOTOR0_LIS_Pin GPIO_PIN_7
#define MOTOR0_LIS_GPIO_Port GPIOA
#define MOTOR0_EN_Pin GPIO_PIN_0
#define MOTOR0_EN_GPIO_Port GPIOB
#define MOTOR2_RIS_Pin GPIO_PIN_2
#define MOTOR2_RIS_GPIO_Port GPIOB
#define MOTOR2_EN_Pin GPIO_PIN_10
#define MOTOR2_EN_GPIO_Port GPIOB
#define MOTOR2_LIS_Pin GPIO_PIN_12
#define MOTOR2_LIS_GPIO_Port GPIOB
#define MOTOR1_LPWM_Pin GPIO_PIN_8
#define MOTOR1_LPWM_GPIO_Port GPIOB
#define MOTOR1_EN_Pin GPIO_PIN_9
#define MOTOR1_EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
